Revit 2024 API
BreakCornerCondition Enumeration
 Condition on which the corner post is inserted.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public enum BreakCornerCondition
Visual Basic
Public Enumeration BreakCornerCondition
Visual C++
public enum class BreakCornerCondition
Members
Member name | Description
EachSegmentEnd |  Corner posts are inserted at each segment end.
AnglesGreaterThan |  Corner posts are inserted only when the angle between neighboring path segments is greater than the defined.
Never |  Corner posts are not inserted in railings.
See Also
Autodesk.Revit.DB.Architecture Namespace